{
    "jobs": [
        {
            "id": 1,
            "title": "Software Engineer",
            "company": "Tech Co.",
            "location": "Toronto, Canada",
            "description": "The Intern Engineer position involves design, analysis and detailing of structural systems for large, complex structures in many market sectors, primarily Type I construction. Interns will work directly with a Project Manager and a team of structural engineers in a dynamic office environment. Interns will be exposed to a wide variety of exciting and challenging projects. We are seeking a talented and enthusiastic Entry-Level Software Engineer to join our growing team in Los Angeles. The ideal candidate will have a strong foundation in computer science principles and experience in programming languages such as C++, C#, and Java. They will be passionate about technology and have a demonstrated ability to learn new concepts quickly.",
            "requirements": [
                "Degree in Computer Science or a related field",
                "Experience with React and Node.js",
                "Design, develop, and test software applications",
                "Collaborate with other engineers to solve complex technical problems",
                "Write clean, maintainable code that follows industry best practices",
                "Stay up-to-date on the latest technologies and trends",
                "Contribute to a positive and collaborative team environment"
            ]
        },
        {
            "id": 2,
            "title": "Marketing Specialist",
            "company": "Tech Co.",
            "location": "Mexico City, Mexico",
            "description": "The Digital Marketing Specialist is responsible for contributing to email and online marketing communications and campaigns that are distributed to member travel agencies and their consumer clients. The Digital Marketing Specialist also collaborates with travel supplier partners to ensure their products and promotional content are presented accurately and compellingly across marketing channels.",
            "requirements": [
                "Bachelors degree in Marketing','1+ years experience in marketing, advertising, or a related field",
                "Strong writing, proofreading, and verbal/interpersonal skills",
                "Excellent organizational skills and attention to detail",
                "Ability multitask and prioritize in a deadlinedriven environment",
                "Innovation – Forward thinking, curious, & creative"
            ]
        },
        {
            "id": 3,
            "title": "Data Scientist",
            "company": "Analytics Innovators",
            "location": "Berlin, Germany",
            "description": "As a Data Scientist, you will analyze complex datasets, develop models, and provide insights to drive business decision-making. The ideal candidate has a strong statistical background, proficiency in Python or R, and experience working with large datasets.",
            "requirements": [
                "Masters or PhD in Statistics, Mathematics, or related field",
                "Experience with machine learning algorithms",
                "Proficient in Python, R, or similar languages",
                "Ability to communicate complex findings to non-technical stakeholders",
                "Experience with big data technologies (Hadoop, Spark) is a plus"
            ]
        },
        {
            "id": 4,
            "title": "UX/UI Designer",
            "company": "Creative Solutions",
            "location": "Sydney, Australia",
            "description": "Join our design team to create visually appealing and user-friendly interfaces. The UX/UI Designer will collaborate with product managers and developers to design innovative solutions. Strong skills in Adobe Creative Suite and a portfolio of previous work are required.",
            "requirements": [
                "Bachelor's degree in Design or a related field",
                "Proven experience in UX/UI design",
                "Proficient in Adobe Creative Suite (Photoshop, Illustrator, XD)",
                "Strong understanding of user-centered design principles",
                "Excellent communication and collaboration skills"
            ]
        },
        {
            "id": 5,
            "title": "Financial Analyst",
            "company": "Global Finance Group",
            "location": "New York City, USA",
            "description": "We are seeking a Financial Analyst to support financial planning and analysis. Responsibilities include budgeting, forecasting, and providing insights into financial performance. The ideal candidate has a strong analytical background and proficiency in financial modeling.",
            "requirements": [
                "Bachelor's degree in Finance, Accounting, or related field",
                "Experience in financial analysis",
                "Advanced proficiency in Microsoft Excel",
                "Strong analytical and problem-solving skills",
                "Excellent attention to detail and organizational abilities"
            ]
        },
        {
            "id": 6,
            "title": "Civil Engineer",
            "company": "Structural Solutions",
            "location": "Tokyo, Japan",
            "description": "Join our team of Civil Engineers working on large-scale infrastructure projects. The role involves design, analysis, and project management. The ideal candidate has a degree in Civil Engineering and experience in structural design.",
            "requirements": [
                "Degree in Civil Engineering or a related field",
                "Experience in structural design",
                "Knowledge of engineering software (AutoCAD, SAP2000)",
                "Strong project management skills",
                "Excellent communication and teamwork abilities"
            ]
        },
        {
            "id": 7,
            "title": "Healthcare Researcher",
            "company": "MedTech Insights",
            "location": "Singapore",
            "description": "Contribute to cutting-edge healthcare research projects. The Healthcare Researcher will gather and analyze data, conduct literature reviews, and support research initiatives. Background in healthcare or life sciences is required.",
            "requirements": [
                "Bachelor's degree in Healthcare Management or Life Sciences",
                "Experience in healthcare research",
                "Strong analytical and research skills",
                "Excellent written and verbal communication skills",
                "Ability to work independently and collaboratively"
            ]
        },
        {
            "id": 8,
            "title": "Cybersecurity Analyst",
            "company": "Secure Systems Ltd",
            "location": "Dubai, UAE",
            "description": "Protect our organization's IT infrastructure by analyzing and implementing cybersecurity measures. The Cybersecurity Analyst will monitor security alerts, conduct risk assessments, and ensure compliance with security policies.",
            "requirements": [
                "Bachelor's degree in Cybersecurity or a related field",
                "Experience in cybersecurity analysis",
                "Knowledge of security frameworks and protocols",
                "Certifications such as CISSP or CEH are a plus",
                "Ability to stay updated on the latest cybersecurity trends"
            ]
        },
        {
            "id": 9,
            "title": "Biomedical Engineer",
            "company": "HealthTech Innovations",
            "location": "Seoul, South Korea",
            "description": "Contribute to the development of innovative medical devices. The Biomedical Engineer will design and test medical equipment, collaborate with cross-functional teams, and ensure compliance with regulatory standards.",
            "requirements": [
                "Degree in Biomedical Engineering or a related field",
                "Experience in medical device design",
                "Knowledge of regulatory requirements (FDA, CE)",
                "Strong problem-solving and teamwork skills",
                "Excellent attention to detail"
            ]
        },
        {
            "id": 10,
            "title": "Environmental Scientist",
            "company": "GreenEarth Solutions",
            "location": "Cape Town, South Africa",
            "description": "Join our team focused on environmental sustainability. The Environmental Scientist will conduct research, analyze data, and provide recommendations for eco-friendly practices. Background in environmental science or a related field is required.",
            "requirements": [
                "Bachelor's or Master's degree in Environmental Science",
                "Experience in environmental research",
                "Knowledge of environmental regulations",
                "Strong data analysis and reporting skills",
                "Passion for sustainability and environmental conservation"
            ]
        },
        {
            "id": 11,
            "title": "AI/ML Engineer",
            "company": "Tech Innovations Ltd",
            "location": "Paris, France",
            "description": "Seeking an AI/ML Engineer to develop and implement machine learning algorithms. The ideal candidate has a strong background in artificial intelligence, deep learning, and experience with frameworks like TensorFlow or PyTorch.",
            "requirements": [
                "Master's or PhD in Computer Science or related field",
                "Experience in AI/ML development",
                "Proficiency in TensorFlow, PyTorch, or similar frameworks",
                "Strong programming skills in Python",
                "Ability to work on complex problem-solving"
            ]
        },
        {
            "id": 12,
            "title": "Graphic Designer",
            "company": "Creative Studios Inc",
            "location": "Barcelona, Spain",
            "description": "Join our design team as a Graphic Designer to create visually stunning graphics for various projects. Proficiency in graphic design software and a keen eye for aesthetics are essential.",
            "requirements": [
                "Bachelor's degree in Graphic Design or related field",
                "Proven experience as a Graphic Designer",
                "Proficient in Adobe Creative Suite (Photoshop, Illustrator)",
                "Strong portfolio showcasing design projects",
                "Creativity and attention to detail"
            ]
        },
        {
            "id": 13,
            "title": "Financial Planner",
            "company": "Wealth Management Group",
            "location": "Zurich, Switzerland",
            "description": "Seeking a Financial Planner to assist clients in managing their financial portfolios. The role involves financial analysis, investment planning, and providing personalized financial advice.",
            "requirements": [
                "Bachelor's degree in Finance or related field",
                "Certified Financial Planner (CFP) designation",
                "Experience in financial planning and analysis",
                "Excellent interpersonal and communication skills",
                "Knowledge of investment strategies and market trends"
            ]
        },
        {
            "id": 14,
            "title": "Game Developer",
            "company": "Gaming Dynamics LLC",
            "location": "Tokyo, Japan",
            "description": "Join our game development team to create immersive gaming experiences. The Game Developer will be involved in the entire game development lifecycle, from concept to implementation.",
            "requirements": [
                "Bachelor's degree in Game Development or related field",
                "Experience in game development using Unity or Unreal Engine",
                "Proficiency in programming languages such as C++ or C#",
                "Passion for gaming and understanding of industry trends",
                "Strong problem-solving and teamwork abilities"
            ]
        },
        {
            "id": 15,
            "title": "Digital Marketing Manager",
            "company": "Online Ventures Co",
            "location": "London, UK",
            "description": "Lead our digital marketing initiatives to drive online visibility and customer engagement. The Digital Marketing Manager will develop and implement digital marketing strategies across various channels.",
            "requirements": [
                "Bachelor's degree in Marketing or related field",
                "Proven experience in digital marketing",
                "Strong knowledge of SEO, SEM, and social media marketing",
                "Analytical and data-driven mindset",
                "Excellent leadership and communication skills"
            ]
        },
        {
            "id": 16,
            "title": "Electrical Engineer",
            "company": "PowerTech Solutions",
            "location": "Seoul, South Korea",
            "description": "Join our team of Electrical Engineers to design and develop electrical systems. The role involves schematic design, testing, and troubleshooting of electronic components.",
            "requirements": [
                "Degree in Electrical Engineering or related field",
                "Experience in schematic design and PCB layout",
                "Proficiency in CAD software for electrical design",
                "Strong analytical and problem-solving skills",
                "Knowledge of industry standards and regulations"
            ]
        },
        {
            "id": 17,
            "title": "Fashion Designer",
            "company": "Chic Couture Creations",
            "location": "Milan, Italy",
            "description": "Seeking a talented Fashion Designer to create unique and stylish clothing collections. The Fashion Designer will be responsible for concept development, sketching, and collaborating with production teams.",
            "requirements": [
                "Degree in Fashion Design or related field",
                "Proven experience as a Fashion Designer",
                "Creative flair and strong artistic skills",
                "Knowledge of fashion trends and materials",
                "Excellent attention to detail"
            ]
        },
        {
            "id": 18,
            "title": "Supply Chain Analyst",
            "company": "Logistics Solutions Ltd",
            "location": "Shanghai, China",
            "description": "Contribute to our supply chain management by analyzing data, optimizing processes, and ensuring efficient logistics operations. The Supply Chain Analyst will work closely with procurement and distribution teams.",
            "requirements": [
                "Bachelor's degree in Supply Chain Management or related field",
                "Experience in supply chain analysis",
                "Proficiency in data analysis tools (Excel, SQL)",
                "Strong organizational and problem-solving skills",
                "Knowledge of logistics and procurement processes"
            ]
        },
        {
            "id": 19,
            "title": "Biotech Research Scientist",
            "company": "Genomic Discoveries Inc",
            "location": "San Francisco, USA",
            "description": "Join our biotech research team to contribute to groundbreaking discoveries. The Biotech Research Scientist will conduct experiments, analyze genomic data, and collaborate on innovative research projects.",
            "requirements": [
                "PhD in Biotechnology, Genetics, or related field",
                "Experience in biotech research",
                "Knowledge of molecular biology techniques",
                "Strong analytical and research skills",
                "Ability to work in a collaborative research environment"
            ]
        },
        {
            "id": 20,
            "title": "Human Resources Manager",
            "company": "Global Enterprises Inc",
            "location": "Dubai, UAE",
            "description": "Lead our human resources initiatives to attract, develop, and retain top talent. The HR Manager will oversee recruitment, employee relations, and HR strategy implementation.",
            "requirements": [
                "Bachelor's degree in Human Resources or related field",
                "Proven experience as an HR Manager",
                "Strong knowledge of HR policies and regulations",
                "Excellent interpersonal and communication skills",
                "Ability to lead and manage HR functions"
            ]
        }
    ],
    "users": [
        { "id": 1, "username": "employer1", "password": "$2b$10$MaZp...", "role": "employer" },
        { "id": 2, "username": "candidate1", "password": "$2b$10$yqoY...", "role": "candidate" }
      ]
}